Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	if (rx_callback_continuation.IsLinked()) {
#		ifdef SI4468_FORCE_MAC_SERVICE
		si446x_debug_print(ERR100, "SI446X: si446x_hal_rx() ERROR! Previously completed radio op not serviced. New request denied.\r\n");
		return DS_Bug;
#		endif
		// Lock and check again before we remove it.
		GLOBAL_LOCK(irq);
		if (rx_callback_continuation.IsLinked()) {
			rx_callback_continuation.Abort();
			irq.Release();
			si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx() Warning! RX attempt before previous RX serviced.\r\n");
			si446x_debug_print(DEBUG02, "SI446X: si446x_hal_rx() ...Servicing previous before continuing...\r\n");
			rx_cont_do(NULL);
		} else {
			irq.Release();
		}
	}


	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_rx() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}
	spi_lock = radio_lock_rx;

	// Supposedly this property is squirrely and likes to mutate
	// This should be temp1==0 temp2==1 for 1-byte length field
	// Give it a couple of days, if not an issue can remove it.
	{
		uint8_t temp[2];
		si446x_get_property_multi(0x12, 0x02, 0x0D, temp);
		if (temp[0] != 0 || temp[1] != 1) {
			si446x_debug_print(ERR100, "SI446X: si446x_hal_rx() WARNING, PKT_FIELD_1_LENGTH mutation! Tell Nathan\r\n");
		}
	}

	si446x_start_rx_fast_channel(si446x_channel);
	si446x_spi_unlock();
	return DS_Success;
}

// This will cancel any radio ops, i.e unlocks the radio.
DeviceStatus si446x_hal_sleep(UINT8 radioID) {
	si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep()\r\n");

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}
	spi_lock = radio_lock_sleep;

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_change_state(SI_STATE_SLEEP);

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


DeviceStatus si446x_hal_tx_power(UINT8 radioID, int pwr) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power()\r\n");

	if (pwr < 0) return DS_Fail; // Not worth of a printf

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}
	spi_lock = radio_lock_tx_power;

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	radio_lock = radio_lock_tx_power;

	si446x_set_property( 0x22 , 1, 0x01, (uint8_t) pwr );
	tx_power = pwr;

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}

DeviceStatus si446x_hal_set_channel(UINT8 radioID, int channel) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel()\r\n");
	if (channel < 0 ) return DS_Fail;

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}
	spi_lock = radio_lock_set_channel;

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	radio_lock = radio_lock_set_channel;

	si446x_channel = channel;

	// Technically may not need the locks.
	// But could confuse the user otherwise.
	// And still at least protects the vars.
	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


// Doesn't belong in radio driver... --NPS
//Properties of radio
static INT8 radioType;
void si446x_hal_set_RadioType(INT8 radio)
{
	radioType = radio;
}

// Doesn't belong in radio driver...
INT8 si446x_hal_get_RadioType()
{
	return radioType;
}

DeviceStatus si446x_hal_cca_ms(UINT8 radioID, UINT32 ms) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() ms:%d\r\n",ms);

	DeviceStatus ret;

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. No Init.\r\n");
		return DS_Fail;
	}

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}
	spi_lock = radio_lock_cca_ms;

	if ( !si446x_radio_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( rx_callback_continuation.IsLinked() || tx_callback_continuation.IsLinked() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms() FAIL. Continuation Pending.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	radio_lock = radio_lock_cca_ms;
	si_state_t state = si446x_request_device_state();

	// Check for bad state while we're at it.
	if (state == SI_STATE_TX || state == SI_STATE_TX_TUNE || state == SI_STATE_ERROR) {
		si446x_debug_print(ERR100, "SI446X: si446x_hal_cca_ms(): Warning, impossible state.\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		return DS_Fail;
	}

	// If radio is already in RX, stay in RX.
	// If a packet comes in, shouldn't lose it.
	if ( state == SI_STATE_RX_TUNE || state == SI_STATE_RX ) {
		while (state == SI_STATE_RX_TUNE) { state = si446x_request_device_state(); }
		HAL_Time_Sleep_MicroSeconds(ms);
		si446x_get_modem_status( 0xFF );
		if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
			ret = DS_Busy;
		else
			ret = DS_Success;
		si446x_radio_unlock();
		si446x_spi_unlock();
		return ret;
	}

	// Otherwise we were asleep and need to stay asleep
	uint8_t int_enable;
	int_enable = si446x_get_property(0x01, 1, 0); 	// save interrupt states
	si446x_set_property(0x01, 1, 0, 0); 			// Writes 0, disables all interrupts

	si446x_get_int_status(0xFF, 0xFF, 0xFF); 		// Check interrupts, does NOT clear.

	// If there are any interrupts pending at this point, back-off
	// TX continuation check may be not necessary.
	if (si446x_get_ph_pend() || si446x_get_modem_pend() || rx_callback_continuation.IsLinked() || tx_callback_continuation.IsLinked()) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca_ms(): Radio not idle, aborting CCA\r\n");
		si446x_radio_unlock();
		si446x_spi_unlock();
		si446x_set_property(0x01, 1, 0, int_enable); 	// Re-enables interrupts
		return DS_Fail;
	}

	si446x_start_rx_fast_channel(si446x_channel);
	while (state != SI_STATE_RX) { state = si446x_request_device_state(); }
	HAL_Time_Sleep_MicroSeconds(ms);
	si446x_get_modem_status( 0xFF );
	if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
		ret = DS_Busy;
	else
		ret = DS_Success;

	si446x_change_state(SI_STATE_SPI_ACTIVE); 		// disables RX
	si446x_fifo_info(0x3); 							// Clear FIFO in case we caught something.
	si446x_set_property(0x01, 1, 0, int_enable); 	// Re-enables interrupts
	si446x_change_state(SI_STATE_SLEEP); 			// All done, sleep.

